[
  {
    "name": "Strawberry Cheesecake Macarons",
    "total_time_minutes": 110,
    "num_servings": 16,
    "instructions": [
      "In a medium bowl, beat the egg whites until frothy. Keep beating and slowly add the sugar until stiff peaks form. ",
      "Sift the powdered sugar and almond flour over the egg whites. Fold the dry mixture into the egg whites, giving the bowl a quarter turn every third fold. Once the batter reaches a lava-like consistency, transfer half to another bowl and add the food coloring. Mix until just combined. Do not overmix!",
      "Working quickly, put the white and pink batters into separate small zip-top bags. Cut a corner off of each bag and squeeze the 2 batters evenly into a larger gallon-size bag or piping bag to create a multicolor effect.",
      "Line a baking sheet with parchment paper. (Tip: use a little batter to 'glue' down the edges of the parchment paper so it stays put). In a circular motion, pipe 1 1/2-inch (4-cm) dollops onto the baking sheet. Lift the baking sheet and gently tap on the counter to settle the batter. Let the cookies rest for 1 hour, until they are no longer wet to the touch and a skin forms on top.",
      "Preheat the oven to 285degreesF (140degreesC).",
      "Make the filling by mixing the cream cheese, powdered sugar, and milk in a medium bowl until smooth. Transfer to a piping bag and set aside until ready to fill the cookies.",
      "When the cookies are dry to the touch, bake for 13-15 minutes, until they have risen. Let them cool for 10 minutes. To fill, pipe a circle of the cream cheese mixture around the edge of 1 cookie and place a small dollop of jam in the center. Sandwich with another cookie. Macarons are best kept refrigerated until serving.",
      "Enjoy!"
    ],
    "id": 1,
    "ingredients": [
      {
        "raw_text": "3 eggs whites, room temperature",
        "ingredient_name": "egg white"
      },
      {
        "raw_text": "1/4 cup sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "1 3/4 cup powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "1 cup superfine almond flour",
        "ingredient_name": "superfine almond flour"
      },
      {
        "raw_text": "3 drops red food coloring",
        "ingredient_name": "red food coloring"
      },
      {
        "raw_text": "1 8-ounce package of cream cheese",
        "ingredient_name": "cream cheese"
      },
      {
        "raw_text": "1 cup powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "2 tablespoons milk",
        "ingredient_name": "milk"
      },
      {
        "raw_text": "Strawberry jam",
        "ingredient_name": "strawberry jam"
      }
    ]
  },
  {
    "name": "Fall Ratatouille",
    "total_time_minutes": 120,
    "num_servings": 8,
    "instructions": [
      "Preheat the oven to 375degreesF (190degreesC).",
      "Make the puree: In a medium pot, heat the olive oil over medium heat until it begins to shimmer. Add the onion, sweet potato, potato, apple, thyme, and salt. Saute for 8-10 minutes, until the vegetables begin to release their juices and soften.",
      "Add 1/2 cup (120 ml) of vegetable stock and cover the pan. Reduce the heat to medium-low and cook for 20-25 minutes, until the vegetables are completely softened. Remove the pot from the heat.",
      "Remove the thyme stems and discard. Add the remaining 1/4 cup (60 ml) of vegetable stock and, using an immersion blender, blend until completely smooth. Season with more salt to taste.",
      "Spread the puree over the bottom of an 10-inch (25 cm) cast iron skillet. Arrange the orange sweet potatoes, yellow potatoes, purple sweet potatoes, delicata squash, and apple slices in an alternating pattern on top, working from the outside in. Drizzle the olive oil over the top and season with the salt, pepper, and thyme.",
      "Cover the pan with foil and bake the ratatouille for 30 minutes, then uncover and bake for another 20-25 minutes, until the vegetables are softened and starting to brown.",
      "Drizzle the ratatouille with more olive oil to taste. Serve warm.",
      "Enjoy!"
    ],
    "id": 2,
    "ingredients": [
      {
        "raw_text": "2 tablespoons olive oil",
        "ingredient_name": "olive oil"
      },
      {
        "raw_text": "1 small white onion, thinly sliced (about 1 cup)",
        "ingredient_name": "small white onion"
      },
      {
        "raw_text": "3/4 cup orange sweet potato, peeled, cut into 1/4-inch thick rounds",
        "ingredient_name": "orange sweet potato"
      },
      {
        "raw_text": "3/4 cup yellow potato, peeled, cut into 1/4-inch thick rounds",
        "ingredient_name": "yellow potato"
      },
      {
        "raw_text": "1/2 cup Gala apple, peeled, roughly chopped",
        "ingredient_name": "gala apple"
      },
      {
        "raw_text": "3 sprigs of fresh thyme",
        "ingredient_name": "fresh thyme"
      },
      {
        "raw_text": "1 teaspoon kosher salt, plus more to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "3/4 cup vegetable stock, divided",
        "ingredient_name": "vegetable stock"
      },
      {
        "raw_text": "3 small orange sweet potatoes, 1 1/2-2-inches wide, cut into 1/8-inch thick rounds (about 1 pound)",
        "ingredient_name": "small orange sweet potatoes"
      },
      {
        "raw_text": "3-4 small yellow potatoes, 1 1/2-2-inches wide, cut into 1/8-inch thick rounds (about 1 pound)",
        "ingredient_name": "small yellow potato"
      },
      {
        "raw_text": "2-3 small purple sweet potatoes, 1 1/2-2-inches wide, cut into 1/8-inch thick rounds (about 1 pound)",
        "ingredient_name": "small purple potatoes"
      },
      {
        "raw_text": "1 small delicata squash, 2 inches wide, seeds removed, cut into 1/8-inch thick half-moons (about 3/4 pounds)",
        "ingredient_name": "delicata squash"
      },
      {
        "raw_text": "3-4 small Gala apples, cored, cut into 1/8-inch thick rounds (about 1 pounds)",
        "ingredient_name": "gala apple"
      },
      {
        "raw_text": "1 tablespoon olive oil, plus more to taste",
        "ingredient_name": "olive oil"
      },
      {
        "raw_text": "1 teaspoon kosher salt, plus more to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1/2 teaspoon freshly ground black pepper",
        "ingredient_name": "freshly ground black pepper"
      },
      {
        "raw_text": "3 sprigs of fresh thyme",
        "ingredient_name": "fresh thyme"
      }
    ]
  },
  {
    "name": "Boozy Cotton Candy Milkshake",
    "total_time_minutes": 5,
    "num_servings": 1,
    "instructions": [
      "Dip the rim of a milkshake glass in the melted white chocolate. Dip in the sprinkles, turning to coat, then set aside.",
      "In a blender, combine the cotton candy, ice cream, and brandy. Blend until thick and smooth.",
      "Pour the milkshake into the glass and garnish with more cotton candy. Serve immediately.",
      "Enjoy!"
    ],
    "id": 3,
    "ingredients": [
      {
        "raw_text": "2 ounce white chocolate, melted",
        "ingredient_name": "white chocolate"
      },
      {
        "raw_text": "1 tablespoon rainbow sprinkles",
        "ingredient_name": "rainbow sprinkles"
      },
      {
        "raw_text": "1 cup pink or blue cotton candy, plus more for garnish",
        "ingredient_name": "cotton candy"
      },
      {
        "raw_text": "8 ounces vanilla ice cream",
        "ingredient_name": "vanilla ice cream"
      },
      {
        "raw_text": "1 ounce brandy or vodka",
        "ingredient_name": "brandy"
      }
    ]
  },
  {
    "name": "The Best Birthday Cake",
    "total_time_minutes": 240,
    "num_servings": 12,
    "instructions": [
      "Make the cake: Preheat the oven to 350degreesF (180degreesC). Lightly spray three 8-inch cake pans with nonstick spray. Line the bottoms with parchment paper rounds and spray again.",
      "In a large bowl, whisk together the sour cream, eggs, and egg whites until evenly combined. Add the vanilla and milk and whisk until incorporated.",
      "In the bowl of a stand mixer fitted with a paddle attachment, combine the granulated sugar and salt. Sift in the cake flour, baking soda, and baking powder. Mix on low speed to incorporate.",
      "Cut the butter into tablespoon-sized pieces. With the mixer running on low speed, add the butter to the dry ingredients, one piece at a time. Continue mixing until a sandy, coarse meal forms, 3-4 minutes.",
      "With the mixer running on low speed, pour in one-quarter of the wet ingredients at a time and mix to incorporate, scraping down the sides of the bowl between each addition. Continue mixing until the batter is smooth.",
      "Remove the bowl from the stand mixer and gently fold in the sprinkles with a rubber spatula.",
      "Divide the batter evenly between the prepared cake pans, tapping the pans on the counter a couple of times to release any large air bubbles.",
      "Bake the cakes for 25-30 minutes, until a toothpick inserted into the center of a cake comes out clean. 8. Set the pans on a wire rack and let the cakes cool completely, about 1 hour. Once cooled, run an offset spatula around the edges of the pans to loosen the cakes, then invert onto the rack and remove the parchment rounds.",
      "Meanwhile, make the frosting: In a large bowl with an electric hand mixer (or in a stand mixer fitted with the whisk attachment), whip the butter on medium speed until creamy, about 3 minutes.",
      "With the mixer running on low speed, add the powdered sugar, about 1 cup at a time. Once incorporated, add the cream, vanilla, and salt. Increase the mixer speed to high and beat for 3 minutes, until the frosting is fluffy.",
      "Assemble the cake: Using a large serrated knife, slice a thin layer off the top of each cake to create a flat surface. Discard the scraps.",
      "Smear a bit of frosting onto an 8-inch cake round set on top of a cake stand, then place a cake layer on the round. Use a large offset spatula to spread an even layer of frosting over the cake. Place another cake layer on top and frost. Place the last cake layer, bottom-side up, on top and spread a thin layer of frosting over the top and sides of the cake to make the crumb coat. Refrigerate for 15 minutes, until the frosting is set.",
      "Generously spread a thick, even layer of frosting over the top and sides of the cake. Decorate the cake with the remaining frosting and sprinkles as desired.",
      "Slice and serve. Cake can be kept at room temperature for 2 hrs and refrigerated for 3 days.",
      "Enjoy!"
    ],
    "id": 4,
    "ingredients": [
      {
        "raw_text": "1 cup sour cream, room temperature",
        "ingredient_name": "sour cream"
      },
      {
        "raw_text": "3 large eggs, room temperature",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "3 large egg whites, room temperature",
        "ingredient_name": "large egg white"
      },
      {
        "raw_text": "2 tablespoons vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "1 cup whole milk, room temperature",
        "ingredient_name": "whole milk"
      },
      {
        "raw_text": "21/4 cups granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "11/2 teaspoons kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "31/2 cups cake flour",
        "ingredient_name": "cake flour"
      },
      {
        "raw_text": "1 teaspoon baking soda",
        "ingredient_name": "baking soda"
      },
      {
        "raw_text": "1 teaspoon baking powder",
        "ingredient_name": "baking powder"
      },
      {
        "raw_text": "11/2 cups (3 sticks) unsalted butter, room temperature",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "1/2 cup rainbow sprinkles",
        "ingredient_name": "rainbow sprinkles"
      },
      {
        "raw_text": "3 cups (6 sticks) unsalted butter, room temperature",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "3 pounds powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "1/3 cup heavy cream",
        "ingredient_name": "heavy cream"
      },
      {
        "raw_text": "2 teaspoon vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "1 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "Rainbow sprinkles, for decorating",
        "ingredient_name": "rainbow sprinkles"
      },
      {
        "raw_text": "1 8-inch cardboard cake round",
        "ingredient_name": "cardboard cake round"
      },
      {
        "raw_text": "Cake turntable",
        "ingredient_name": "cake turntable"
      }
    ]
  },
  {
    "name": "Spicy Rice Noodles With Ground Pork And Scallions",
    "total_time_minutes": 30,
    "num_servings": 4,
    "instructions": [
      "Place the noodles in a large bowl and add boiling water to cover. Use tongs to separate the noodles to prevent clumping, then let sit for 5 minutes to soften. Reserve 1/4 cup of the noodle soaking water and drain the noodles.",
      "Meanwhile, heat the sesame oil in a wok or large skillet over high heat. Add the pork and minced scallions, season with salt and pepper, and cook, stirring to break up the pork with a wooden spoon, until browned, 6-8 minutes.",
      "Add the noodles, reserved soaking water, and the chile-garlic paste to the wok and stir until the noodles are evenly coated in the sauce.",
      "Transfer the noodles and sauce to serving bowls and top with the sliced scallion greens. Serve with more sesame oil and chile-garlic paste alongside.",
      "Enjoy!"
    ],
    "id": 5,
    "ingredients": [
      {
        "raw_text": "14 ounces flat rice noodles, such as for pad Thai",
        "ingredient_name": "flat rice noodle"
      },
      {
        "raw_text": "Boiling water, for soaking noodles",
        "ingredient_name": "boiling water"
      },
      {
        "raw_text": "2 tablespoons toasted sesame oil, plus more for serving",
        "ingredient_name": "toasted sesame oil"
      },
      {
        "raw_text": "11/2 pounds ground pork",
        "ingredient_name": "ground pork"
      },
      {
        "raw_text": "6 scallions, white and light green parts minced, dark green parts thinly sliced",
        "ingredient_name": "scallions"
      },
      {
        "raw_text": "Kosher salt, to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "Freshly ground black pepper, to taste",
        "ingredient_name": "freshly ground black pepper"
      },
      {
        "raw_text": "2 tablespoons chile-garlic paste, plus more for serving",
        "ingredient_name": "chile-garlic paste"
      }
    ]
  },
  {
    "name": "Spicy Southern Hot Corn",
    "total_time_minutes": 35,
    "num_servings": 4,
    "instructions": [
      "Melt the butter in a large cast iron skillet over medium heat. Add the cream cheese and cook until softened and spreadable, about 3 minutes.",
      "Add the pickled jalapenos, jalapeno brine, and red and green bell peppers. Saute for 3 minutes, until the peppers are tender.",
      "Add the corn, paprika, and salt and saute until fully combined, about 5 minutes.",
      "Stir in 1/2 cup (50 G) of cheddar cheese. Spread the corn in an even layer, then sprinkle the remaining 1/2 cup (50 G) cheddar cheese on top.",
      "Turn the broiler on. Transfer the skillet to the oven and broil for 10 minutes, or until the cheese on top is golden brown.",
      "Remove the pan from the oven. Let cool for 5 minutes. Top with the Mexican crema and green onions, then serve warm.",
      "Enjoy!"
    ],
    "id": 6,
    "ingredients": [
      {
        "raw_text": "2 tablespoons unsalted butter",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "4 ounces cream cheese, cubed",
        "ingredient_name": "cream cheese"
      },
      {
        "raw_text": "3 tablespoons chopped pickled jalapenos",
        "ingredient_name": "jalapeno"
      },
      {
        "raw_text": "1 tablespoon pickled jalapeno brine",
        "ingredient_name": "jalapeno brine"
      },
      {
        "raw_text": "1/2 cup diced red bell pepper",
        "ingredient_name": "red bell pepper"
      },
      {
        "raw_text": "1/2 cup diced green bell pepper",
        "ingredient_name": "green bell pepper"
      },
      {
        "raw_text": "2 15-ounce cans of yellow corn, drained",
        "ingredient_name": "yellow corn"
      },
      {
        "raw_text": "1 teaspoon paprika",
        "ingredient_name": "paprika"
      },
      {
        "raw_text": "1 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 cup shredded cheddar cheese, divided",
        "ingredient_name": "shredded cheddar cheese"
      },
      {
        "raw_text": "2 tablespoons Mexican crema, for garnish",
        "ingredient_name": "mexican crema"
      },
      {
        "raw_text": "2 green onions, sliced, for garnish",
        "ingredient_name": "green onion"
      }
    ]
  },
  {
    "name": "Onion Bhajis",
    "total_time_minutes": 40,
    "num_servings": 24,
    "instructions": [
      "Fill a large pot fitted with a deep fry thermometer halfway with oil. Heat over medium heat until the temperature reaches 325degreesF (160 degrees C). Place a wire rack over a baking sheet and set nearby.",
      "Set a mandoline slicer to 1/4 inch and place over a large bowl. Carefully slice the onions on the mandoline, letting them fall into the bowl below (alternatively, use a sharp knife to cut the onions into 1/4-inch-thick slices and add to the bowl). Sprinkle the salt over the onions, toss to coat, and let sit for about 5 minutes to draw out excess moisture.",
      "Add the coriander, chili powder, cumin, and turmeric to the onions and use tongs to toss until evenly coated, using your hands to break up any pieces of onions still stuck together. Let sit for 15-30 minutes, until the onions have softened.",
      "Add the green chile and cilantro and toss to combine. Add 1/2 cup of the chickpea flour and toss to coat the onions. Add 2 tablespoons of water and continue to toss until the water is absorbed. Repeat with another 1/2 cup gram flour and 2 tablespoons water. Add the remaining 1/2 gram flour and toss until the onions are coated in a thick, homogeneous batter. If the batter is too clumpy, add 1-2 more tablespoons of water and toss until smooth.",
      "Use your hands to grab a small clump of the onion mixture (a bit smaller than a golf ball) and very carefully drop into the hot oil (don't compact the clump too much; the edges should be somewhat scraggly and loose). Add 1-2 more clumps, making sure not to overcrowd the pot. The oil temperature should remain between 300-325degreesF (150-160˚C). Fry the bhajis for 3-5 minutes, flipping once or twice as needed for even browning, until deep golden brown in color. Use a spider or slotted spoon to transfer to the wire rack to drain. Immediately sprinkle with a bit of salt. Repeat with the remaining batter, letting the oil return to temperature between batches.",
      "Serve the onion bhajis with red and green chutney.",
      "Enjoy!"
    ],
    "id": 7,
    "ingredients": [
      {
        "raw_text": "Neutral oil, for frying",
        "ingredient_name": "neutral oil"
      },
      {
        "raw_text": "3 medium yellow onions, halved",
        "ingredient_name": "medium yellow onion"
      },
      {
        "raw_text": "11/2 teaspoons kosher salt, plus more for sprinkling",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "11/2 teaspoons ground coriander",
        "ingredient_name": "ground coriander"
      },
      {
        "raw_text": "11/2 teaspoons chili powder",
        "ingredient_name": "chili powder"
      },
      {
        "raw_text": "11/2 teaspoons ground cumin",
        "ingredient_name": "ground cumin"
      },
      {
        "raw_text": "1 teaspoon ground turmeric",
        "ingredient_name": "ground turmeric"
      },
      {
        "raw_text": "1 small green chile, seeded if desired, finely chopped",
        "ingredient_name": "small green chile"
      },
      {
        "raw_text": "3 tablespoons finely chopped fresh cilantro leaves",
        "ingredient_name": "fresh cilantro leaves"
      },
      {
        "raw_text": "11/2 cups chickpea (gram) flour",
        "ingredient_name": "chickpea flour"
      },
      {
        "raw_text": "4-6 tablespoons water",
        "ingredient_name": "water"
      },
      {
        "raw_text": "Red and green chutney, for serving",
        "ingredient_name": "Red and green chutney"
      }
    ]
  },
  {
    "name": "Strawberry Matcha Mochi Butter Cake",
    "total_time_minutes": 130,
    "num_servings": 8,
    "instructions": [
      "Preheat the oven to 350degreesF (180degreesC). Grease a 9 x 13 x 2-inch baking dish with butter.",
      "Make the mochi cake: In a medium bowl, whisk together the sweet rice flour, sugar, matcha, baking powder, and salt.",
      "In a large bowl, whisk together the coconut milk, evaporated milk, eggs, and vanilla. Pour in the melted butter and whisk until incorporated.",
      "Add the dry ingredients to the wet ingredients and whisk until the batter is silky and smooth. Pour the batter into the prepared baking dish.",
      "Bake the cake until the edges begin to pull from the sides of the pan, 50-60 minutes. Remove from the oven and let cool completely, about 1 hour.",
      "Make the strawberry icing: Add the freeze-dried strawberries to a food processor and pulse into a fine powder.",
      "Transfer the strawberry powder to a medium bowl. Add the powdered sugar and milk and whisk until smooth.",
      "Pour the glaze over the cake and spread to cover evenly.",
      "Cut the cake into 8 pieces and serve.",
      "Enjoy!"
    ],
    "id": 8,
    "ingredients": [
      {
        "raw_text": "Unsalted butter, for greasing",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "1 16-ounce box of sweet rice flour",
        "ingredient_name": "sweet rice flour"
      },
      {
        "raw_text": "21/2 cups granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "2 tablespoons matcha powder",
        "ingredient_name": "matcha powder"
      },
      {
        "raw_text": "1 tablespoon baking powder",
        "ingredient_name": "baking powder"
      },
      {
        "raw_text": "1/4 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 13.5-ounce can of unsweetened full-fat coconut milk",
        "ingredient_name": "unsweetened full fat coconut milk"
      },
      {
        "raw_text": "1 12.2-ounce can of evaporated milk",
        "ingredient_name": "evaporated milk"
      },
      {
        "raw_text": "5 large eggs, room temperature",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "1 teaspoon vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "1/2 cup (1 stick) unsalted butter, melted and cooled",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "1 1.2-ounce package of freeze-dried strawberries",
        "ingredient_name": "freeze-dried strawberry"
      },
      {
        "raw_text": "2 cups powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "3-4 tablespoons milk of choice",
        "ingredient_name": "milk"
      }
    ]
  },
  {
    "name": "Classic Coffee Cake",
    "total_time_minutes": 90,
    "num_servings": 1,
    "instructions": [
      "Preheat the oven to 350degreesF (180degreesC). Lightly grease a 9 x 13-inch baking dish or 2 9-inch round cake pans with nonstick spray.",
      "Make the brown butter streusel topping: Add the butter to a small light-colored saucepan over medium heat. Swirl the pan occasionally until the butter completely melted, then continue cooking, swirling or stirring with a heatproof spatula occasionally, until the butter bubbles and foams, then begins to brown as the foam subsides. Once the butter is golden brown and smells nutty, 5-8 minutes total, transfer to a heatproof container (make sure to get all the delicious browned bits from the bottom of the pot) and let cool to room temperature for 5-10 minutes before using.",
      "In a medium bowl, whisk together the sugar, salt, flour, and cinnamon. Add the browned butter and stir with a rubber spatula until well combined.",
      "Make the filling: In a small bowl, mix together the brown sugar, and cinnamon.",
      "Make the cake: In a liquid measuring cup or medium bowl, whisk together the milk and sour cream until well combined.",
      "In a medium bowl, whisk together the flour, salt, and baking powder until well combined",
      "In a large bowl, cream together the butter, granulated sugar, and brown sugar with an electric hand mixer on medium speed until light and fluffy, 2-3 minutes. Add the vanilla, then the eggs, 1 at a time, beating well after each addition.",
      "Add a third of the flour to the butter mixture, beating on low speed to combine. Add half of the milk mixture and beat to incorporate. Continue alternating between the dry and wet ingredients, beating between each addition just to incorporate before adding the next. Do not overmix.",
      "Pour half of the batter into the prepared baking dish and spread all the way to the edges. (If using 2 9-inch round pans, spread about 11/3 cups batter in each pan.) Sprinkle the filling evenly over the batter. Spread the remaining batter on top of the filling, all the way to the edges of the pan, then use a butter knife to gently swirl the filling into the batter. Crumble the streusel evenly on top.",
      "Bake the coffee cake until dark golden brown around the edges and a toothpick inserted in the center of the cake comes out clean, 55 minutes for a large pan or 50-55 minutes for 2 smaller pans.",
      "Remove the cake from the oven and let cool for 20 minutes before slicing and serving straight from the pan.",
      "Enjoy!"
    ],
    "id": 9,
    "ingredients": [
      {
        "raw_text": "Nonstick cooking spray, for greasing",
        "ingredient_name": "nonstick cooking spray"
      },
      {
        "raw_text": "8 tablespoons (1 stick) unsalted butter",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "3/4 cup granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "1/4 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1/2 cup all-purpose flour",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "1 tablespoon ground cinnamon",
        "ingredient_name": "ground cinnamon"
      },
      {
        "raw_text": "1 cup brown sugar",
        "ingredient_name": "brown sugar"
      },
      {
        "raw_text": "11/2 tablespoons ground cinnamon",
        "ingredient_name": "ground cinnamon"
      },
      {
        "raw_text": "11/4 cups whole milk",
        "ingredient_name": "whole milk"
      },
      {
        "raw_text": "3/4 cup sour cream or full-fat plain yogurt",
        "ingredient_name": "sour cream"
      },
      {
        "raw_text": "33/4 cups all-purpose flour",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "11/4 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "21/2 teaspoons baking powder",
        "ingredient_name": "baking powder"
      },
      {
        "raw_text": "3/4 cup (11/2 sticks) unsalted butter, softened",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "11/2 cups granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "1/3 cup brown sugar",
        "ingredient_name": "brown sugar"
      },
      {
        "raw_text": "1 tablespoon vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "3 large eggs",
        "ingredient_name": "large egg"
      }
    ]
  },
  {
    "name": "Crab Rangoon Egg Rolls",
    "total_time_minutes": 35,
    "num_servings": 8,
    "instructions": [
      "In a large bowl, mix together the cream cheese, a pinch of salt, soy sauce, and sugar until well combined. Gently fold in the crab meat and scallions until evenly incorporated.",
      "Place a wonton wrapper on a clean surface in a diamond orientation. Brush the edges of the wrapper with the beaten egg. Scoop 3 tablespoons of the crab filling onto the center of the wrapper and flatten slightly with a spoon. Fold the sides of the wrapper inwards to cover the filling, then roll the wonton up, starting from the bottom and working upward to seal. Repeat with the remaining wrappers and filling.",
      "Fill a large pot halfway with peanut oil. Heat over medium-high heat until the temperature reaches 375 degrees F (190 degrees C). Set a wire rack over a baking sheet.",
      "Working 3-4 at a time, fry the egg rolls in the hot oil until the wrappers are puffed and golden, about 2 minutes, flipping halfway to ensure even color. Transfer to the wire rack and sprinkle with salt.",
      "Serve the egg rolls with your favorite dipping sauce, such as sweet and sour sauce.",
      "Enjoy!"
    ],
    "id": 10,
    "ingredients": [
      {
        "raw_text": "6 ounces cream cheese, room temperature",
        "ingredient_name": "cream cheese"
      },
      {
        "raw_text": "11/2 teaspoons sugar",
        "ingredient_name": "sugar"
      },
      {
        "raw_text": "2 teaspoons light soy sauce",
        "ingredient_name": "light soy sauce"
      },
      {
        "raw_text": "Pinch of kosher salt, plus more for sprinkling",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "8 ounces lump crab meat or imitation crab meat, shredded",
        "ingredient_name": "fresh lump crab meat"
      },
      {
        "raw_text": "1/3 cup thinly sliced scallions",
        "ingredient_name": "scallions"
      },
      {
        "raw_text": "12 6-inch square wonton wrappers",
        "ingredient_name": "square wonton wrapper"
      },
      {
        "raw_text": "1 large egg, beaten",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "Peanut oil, for frying",
        "ingredient_name": "peanut oil"
      },
      {
        "raw_text": "Sweet and sour sauce or dipping sauce of choice, for serving",
        "ingredient_name": "sweet and sour sauce"
      }
    ]
  },
  {
    "name": "King Cake",
    "total_time_minutes": 220,
    "num_servings": 12,
    "instructions": [
      "Make the dough: In the bowl of a stand mixer fitted with the dough hook, combine the melted butter, milk, eggs, flour, granulated sugar, yeast, salt, lemon zest, and nutmeg. Mix on medium-low speed for 7-8 minutes, scraping down the sides of the bowl as needed, until the dough is silky smooth.",
      "Shape the dough into a ball.  Grease a medium bowl with nonstick spray, transfer the dough to the bowl, and turn to coat. Cover with plastic wrap and let rise in a warm place for 1 hour, until about 11/2 times its original size.",
      "While the dough is rising, make the filling: In a separate medium bowl, combine the softened butter, brown sugar, cinnamon, and salt. Mix with a fork until thoroughly combined.",
      "Make the egg wash: In a small bowl, beat together the egg and milk with a fork until thoroughly combined.",
      "Assemble the king cake: Line a baking sheet with parchment paper.",
      "Turn the dough out onto a lightly floured surface. Lightly flour the top and roll out to a 10 x 22-inch rectangle. Use a pizza cutter or sharp knife to cut the rectangle lengthwise into 3 even strips.",
      "Use a small offset or silicone spatula to spread the filling evenly over half of the long side of each strip, leaving the other half of each strip uncovered. Brush the uncovered dough lightly with the egg wash. Starting from the side with the filling, roll each strip into a log and position seam-side down. Press one end of each of the logs together, then braid the logs into a single long strand. Bring the ends of the braid together to make a ring, pressing together to secure. Carefully transfer the ring to the prepared baking sheet, making sure to maintain the large opening in the center. Cover with plastic wrap and let proof in a warm place for 30-45 minutes, until the dough is pillowy to the touch.",
      "Preheat the oven to 375degreesF (190degreesC).",
      "Brush the ring with egg wash. Bake for 30-32 minutes, until golden brown. Remove from the oven and let cool completely, about 1 hour.",
      "Decorate the cake: Carefully flip the cake upside down and use a sharp knife to create a small slit in the bottom. Hide the plastic baby in the slit. Flip the cake right-side up.",
      "Make the glaze: In a medium bowl, whisk together the powdered sugar, 2 tablespoons milk, the lemon juice, and vanilla until smooth. Add the remaining milk as needed to create a thick, yet pourable glaze.",
      "Pour the glaze evenly over the top of the cake. While the glaze is still wet, decorate with alternating stripes of green, yellow, and purple sparkling sugar. Let the icing set for at least 30 minutes before slicing and serving.",
      "Enjoy!"
    ],
    "id": 11,
    "ingredients": [
      {
        "raw_text": "8 tablespoons (1 stick) unsalted butter, melted",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "3/4 cup milk, lukewarm",
        "ingredient_name": "milk"
      },
      {
        "raw_text": "2 large eggs, room temperature",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "31/2 cups all-purpose flour, plus more for dusting",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "1/4 cup granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "1 0.25-ounce packet of instant yeast (21/4 teaspoons)",
        "ingredient_name": "instant yeast"
      },
      {
        "raw_text": "1 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 teaspoon lemon zest",
        "ingredient_name": "lemon zest"
      },
      {
        "raw_text": "1/4 teaspoon freshly grated nutmeg",
        "ingredient_name": "freshly grated nutmeg"
      },
      {
        "raw_text": "Nonstick cooking spray, for greasing",
        "ingredient_name": "nonstick cooking spray"
      },
      {
        "raw_text": "6 tablespoons (3/4 stick) unsalted butter, softened",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "3/4 cup brown sugar",
        "ingredient_name": "brown sugar"
      },
      {
        "raw_text": "2 teaspoons ground cinnamon",
        "ingredient_name": "ground cinnamon"
      },
      {
        "raw_text": "1/4 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 large egg",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "1 tablespoon milk",
        "ingredient_name": "milk"
      },
      {
        "raw_text": "21/2 cups powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "2-3 tablespoons milk",
        "ingredient_name": "milk"
      },
      {
        "raw_text": "1 tablespoon lemon juice",
        "ingredient_name": "lemon juice"
      },
      {
        "raw_text": "1 teaspoon vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "Green sparkling sugar",
        "ingredient_name": "green sparkling sugar"
      },
      {
        "raw_text": "Yellow sparkling sugar",
        "ingredient_name": "yellow sparkling sugar"
      },
      {
        "raw_text": "Purple sparkling sugar",
        "ingredient_name": "purple sparkling sugar"
      },
      {
        "raw_text": "1 small plastic baby, pecan, or large dried bean",
        "ingredient_name": "large dried bean"
      }
    ]
  },
  {
    "name": "One-pan Honey Garlic Chicken",
    "total_time_minutes": 52,
    "num_servings": 4,
    "instructions": [
      "Preheat oven to 400 degrees F (200 degrees C)",
      "Season chicken thighs with salt and pepper.",
      "Melt 1 tablespoon butter in a large ovenproof skillet over medium heat. Add chicken, skin-side down, and sear both sides until golden brown. (The skin side will take much longer, in order to properly render the fat and crisp up the skin.)",
      "Remove chicken thighs and set aside. Pour out any excess fat, but leave some in for the sauce.",
      "Add garlic, stir until fragrant, then add brown sugar, honey, thyme, and oregano, and stir. Reduce heat to low.",
      "Return chicken to the skillet. Coat the chicken in the sauce.",
      "Add green beans to skillet.",
      "Bake for 25 minutes or until chicken is cooked through.",
      "Enjoy!"
    ],
    "id": 12,
    "ingredients": [
      {
        "raw_text": "6 bone-in, skin-on chicken thighs",
        "ingredient_name": "bone-in, skin-on chicken thighs"
      },
      {
        "raw_text": "Salt, to taste",
        "ingredient_name": "salt"
      },
      {
        "raw_text": "Pepper, to taste",
        "ingredient_name": "pepper"
      },
      {
        "raw_text": "1 tablespoon unsalted butter",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "3 garlic cloves",
        "ingredient_name": "garlic"
      },
      {
        "raw_text": "1 tablespoon brown sugar",
        "ingredient_name": "brown sugar"
      },
      {
        "raw_text": "1/4 cup honey",
        "ingredient_name": "honey"
      },
      {
        "raw_text": "1 teaspoon dried thyme",
        "ingredient_name": "dried thyme"
      },
      {
        "raw_text": "1 teaspoon dried oregano",
        "ingredient_name": "dried oregano"
      },
      {
        "raw_text": "1 pound green beans",
        "ingredient_name": "green beans"
      }
    ]
  },
  {
    "name": "Fancy Hash Brown",
    "total_time_minutes": 15,
    "num_servings": 1,
    "instructions": [
      "Using a food processor fitted with the large grater attachment (or the large holes on a box grated), shred the potato. Transfer to a medium bowl and toss with the salt, then let sit for about 5 minutes to draw out excess moisture.",
      "Transfer the shredded potato to a clean, lint-free kitchen towel and wring out as much moisture as possible. Wipe out the bowl, then the potato to the bowl and season with pepper. Use your fingers to separate the shreds into a fluffy pile.",
      "Heat a 6-inch cast iron skillet over medium heat until very hot. Line a wire rack or plate with paper towels and set nearby.",
      "Once the skillet is very hot, add 1 tablespoon of ghee and swirl to coat the pan. Carefully transfer the potato shreds to the skillet and use a spatula to gently pat down into a uniform circle. Cook for 3-5 minutes, until the bottom is a deep golden brown and crispy. Set a plate upside-down over the skillet, place your hand on top to hold it in place, and carefully flip the skillet upside down to release the hash brown from the pan. (Be careful, the skillet will be very hot!)",
      "Return the skillet to the heat, then add the remaining tablespoon of ghee. Let the ghee warm for about 30 seconds, then slide the hash brown, uncooked side down, back into the skillet. Cook for another 3-5 minutes, until golden brown, then remove from the skillet and place on the paper towels to drain.",
      "Let the hash brown cool for a few minutes, before topping with a generous dollop of creme fraiche, smoked salmon, chives, dill, and roe. Finish with a squeeze of lemon and serve immediately.",
      "Enjoy!"
    ],
    "id": 13,
    "ingredients": [
      {
        "raw_text": "1 medium russet potato, about 12 ounces, washed",
        "ingredient_name": "medium russet potato"
      },
      {
        "raw_text": "2 tablespoons ghee (clarified butter)",
        "ingredient_name": "ghee"
      },
      {
        "raw_text": "1/2 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "freshly cracked black pepper, to taste",
        "ingredient_name": "freshly cracked pepper"
      },
      {
        "raw_text": "Chives, sliced",
        "ingredient_name": "fresh chives"
      },
      {
        "raw_text": "Dill, picked",
        "ingredient_name": "fresh dill fronds"
      },
      {
        "raw_text": "Creme fraiche",
        "ingredient_name": "creme fraiche"
      },
      {
        "raw_text": "Salmon or trout roe",
        "ingredient_name": "salmon or trout roe"
      },
      {
        "raw_text": "Lemon wedge",
        "ingredient_name": "lemon wedges"
      }
    ]
  },
  {
    "name": "New Orleans Seafood File Gumbo",
    "total_time_minutes": 170,
    "num_servings": 4,
    "instructions": [
      "Make the seafood gumbo stock: In a heavy-bottomed 5-quart pot, heat the canola oil over medium heat. Once the oil is shimmering, add the crabs and cook until the shells turn bright orange, 2-3 minutes. Add the shrimp shells and heads and cook until the shells turn pink, 2-3 minutes more. Smash the crab and shrimp shells, similar to mashing potatoes, to release any juices.",
      "Add the bell pepper, onion, and celery scraps, green onion, parsley, thyme, garlic, bay leaves, black pepper, and water. Bring to a gentle boil, then reduce the heat to medium-low and simmer for 30-35 minutes.",
      "Strain the stock through a large fine-mesh sieve into a large bowl. You should have 12 cups. Set aside until ready to use in the gumbo (if not using immediately, the stock can be cooled, then stored in an airtight container in the refrigerator for 1-3 days).",
      "Make the Creole seasoning: In a small bowl, whisk together the salt, white pepper, black pepper, cayenne, paprika, garlic powder, onion powder, thyme, and oregano until well combined.",
      "Make the gumbo: Heat 6 tablespoons canola oil in a heavy-bottomed 6-quart pot over medium-high heat until faint wisps of white smoke come off the oil (if thicker, darker smoke appears, remove the pot from the heat and let cool for 3 minutes). Add the okra and fry for 2 minutes, until army-green in color. Use a slotted spoon to transfer the okra to a paper towel-lined plate to drain, leaving any remaining oil behind in the pot.",
      "Add the remaining 2 tablespoons of oil to the same pot. Heat the oil over medium-high heat until faintly smoking again (do not let it overheat, or the flour will burn). Whisk in the flour to make a roux and cook, whisking constantly, until it turns a dark cocoa brown, 5-6 minutes. (If the roux is browning too quickly, remove the pot from the heat while continuing to stir and reduce the heat to medium-low.)",
      "Reduce the heat to medium, then add the onion, bell pepper, celery, and 2 tablespoons of the Creole seasoning. Cook, stirring, for 2-3 minutes, until onions have softened. Add the garlic, bay leaves, and remaining Creole seasoning.",
      "Increase the heat to medium-high heat. While whisking or stirring constantly to prevent lumps from forming, add the seafood gumbo stock, 4 cups at a time. Add the okra, smoked sausage, crabs, thyme, and Worcestershire sauce. Bring to a boil, then reduce the heat to low and simmer uncovered for 1 hour, skimming off any foamy flour residue that rises to the surface. The gumbo should thicken and reduce by one quarter.",
      "Season the gumbo with the salt and pepper to taste, then add the shrimp. Remove the pot from the heat, cover, and let the residual heat cook the shrimp for 10 minutes.",
      "Ladle the hot gumbo into bowls. Serve with rice and garnish with parsley, green onions, and file powder, if using.",
      "It's important to properly cool and store leftover seafood gumbo, otherwise it will spoil. Fill a clean 2-liter bottle or plastic juice jug with water and freeze until solid. Once finished eating, place the ice bottle in the pot of gumbo and let cool, stirring occasionally to release heat. Transfer the gumbo to an airtight container and refrigerate for up to 5 days. 11. The gumbo can also be frozen for up to 3 months.",
      "Enjoy!"
    ],
    "id": 14,
    "ingredients": [
      {
        "raw_text": "1 tablespoon canola oil",
        "ingredient_name": "canola oil"
      },
      {
        "raw_text": "3 blue crabs, washed and halved crosswise",
        "ingredient_name": "blue crabs"
      },
      {
        "raw_text": "2 pounds cleaned shrimp shells and heads",
        "ingredient_name": "shrimp shells and heads"
      },
      {
        "raw_text": "Bell pepper, onion, and celery scraps",
        "ingredient_name": "Bell pepper, onion, and celery scraps"
      },
      {
        "raw_text": "1 green onion, halved crosswise",
        "ingredient_name": "green onion"
      },
      {
        "raw_text": "3 sprigs of fresh Italian parsley",
        "ingredient_name": "fresh italian parsley"
      },
      {
        "raw_text": "3 sprigs of fresh thyme",
        "ingredient_name": "fresh thyme"
      },
      {
        "raw_text": "2 garlic cloves",
        "ingredient_name": "garlic"
      },
      {
        "raw_text": "2 dried bay leaves",
        "ingredient_name": "dried bay leaf"
      },
      {
        "raw_text": "1 teaspoon ground black pepper",
        "ingredient_name": "ground black pepper"
      },
      {
        "raw_text": "13 cups water",
        "ingredient_name": "water"
      },
      {
        "raw_text": "11/2 tablespoons kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 tablespoon ground white pepper",
        "ingredient_name": "ground white pepper"
      },
      {
        "raw_text": "2 tablespoons freshly ground black pepper",
        "ingredient_name": "freshly ground black pepper"
      },
      {
        "raw_text": "1 tablespoon cayenne",
        "ingredient_name": "cayenne"
      },
      {
        "raw_text": "1 tablespoon paprika",
        "ingredient_name": "paprika"
      },
      {
        "raw_text": "1 tablespoon garlic powder",
        "ingredient_name": "garlic powder"
      },
      {
        "raw_text": "1 tablespoon onion powder",
        "ingredient_name": "onion powder"
      },
      {
        "raw_text": "3/4 teaspoon dried thyme",
        "ingredient_name": "dried thyme"
      },
      {
        "raw_text": "3/4 teaspoon dried oregano",
        "ingredient_name": "dried oregano"
      },
      {
        "raw_text": "8 tablespoons canola oil, divided",
        "ingredient_name": "canola oil"
      },
      {
        "raw_text": "2 cups sliced okra",
        "ingredient_name": "okra"
      },
      {
        "raw_text": "1/2 cup all-purpose flour",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "1 medium yellow onion, chopped",
        "ingredient_name": "medium yellow onion"
      },
      {
        "raw_text": "1 medium bell pepper, seeded and chopped",
        "ingredient_name": "medium bell pepper"
      },
      {
        "raw_text": "2 celery stalks, chopped",
        "ingredient_name": "celery"
      },
      {
        "raw_text": "4 garlic cloves, minced",
        "ingredient_name": "garlic"
      },
      {
        "raw_text": "2 dried bay leaves",
        "ingredient_name": "dried bay leaf"
      },
      {
        "raw_text": "1 pound smoked sausage, sliced into 1/4-inch-thick rounds",
        "ingredient_name": "smoked sausage"
      },
      {
        "raw_text": "6 blue crabs, washed and halved crosswise",
        "ingredient_name": "blue crabs"
      },
      {
        "raw_text": "5 sprigs of fresh thyme",
        "ingredient_name": "fresh thyme"
      },
      {
        "raw_text": "1 tablespoon Worcestershire sauce",
        "ingredient_name": "worcestershire sauce"
      },
      {
        "raw_text": "Kosher salt, to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "Freshly ground black pepper, to taste",
        "ingredient_name": "freshly ground black pepper"
      },
      {
        "raw_text": "2 pounds shrimp, peeled, deveined, and rinsed",
        "ingredient_name": "shrimp"
      },
      {
        "raw_text": "6 cups cooked rice",
        "ingredient_name": "rice"
      },
      {
        "raw_text": "3 tablespoons chopped fresh Italian parsley",
        "ingredient_name": "fresh italian parsley"
      },
      {
        "raw_text": "1/4 cup sliced green onions",
        "ingredient_name": "green onion"
      },
      {
        "raw_text": "1 teaspoon file powder (optional)",
        "ingredient_name": "file powder"
      }
    ]
  },
  {
    "name": "Potatoes Fondant",
    "total_time_minutes": 50,
    "num_servings": 3,
    "instructions": [
      "Preheat the oven to 400degreesF (200degreesC).",
      "Heat the canola oil in a large cast iron skillet over medium-high heat.",
      "Season the potatoes with salt, then add to the hot skillet, flat-side down. Sear for about 5 minutes, until golden brown, then flip and cook on the other flat side for another 5 minutes.",
      "Add the clarified butter, rosemary, thyme, and garlic to the skillet. Let the butter melt, then use a large spoon to baste the potatoes with the butter until coated, about 30 seconds.. Add the chicken stock and bring to a boil.",
      "Transfer the skillet to the oven and roast the potatoes for 35 minutes, or until tender.",
      "Spoon the pan sauce over the potatoes and garnish with freshly ground black pepper.",
      "Enjoy!"
    ],
    "id": 15,
    "ingredients": [
      {
        "raw_text": "2 tablespoons canola oil",
        "ingredient_name": "canola oil"
      },
      {
        "raw_text": "11/2 pounds Yukon gold potatoes, peeled, ends trimmed, cut into 2-inch-long cylinders",
        "ingredient_name": "yukon gold potato"
      },
      {
        "raw_text": "Kosher salt, to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "4 tablespoons unsalted clarified butter (or ghee)",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "1 sprig of fresh rosemary",
        "ingredient_name": "fresh rosemary"
      },
      {
        "raw_text": "3 sprigs of fresh thyme",
        "ingredient_name": "fresh thyme"
      },
      {
        "raw_text": "6 large garlic cloves, smashed",
        "ingredient_name": "garlic"
      },
      {
        "raw_text": "1 cup chicken stock stock",
        "ingredient_name": "chicken stock"
      },
      {
        "raw_text": "Freshly ground black pepper, to taste",
        "ingredient_name": "freshly ground black pepper"
      }
    ]
  },
  {
    "name": "Bubble Potato Chips",
    "total_time_minutes": 45,
    "num_servings": 2,
    "instructions": [
      "Heat the oil in a heavy-bottomed saucepan over medium heat until the temperature reaches 350degreesF (180degreesC).",
      "Use a mandoline to thinly slice the potatoes into 1/8-inch-thick rounds. Arrange the potato slices in a single layer on a paper towel-lined baking sheet and let dry for 5 minutes.",
      "Lightly dust the cornstarch over half of the potato slices, then use a pastry brush to distribute the cornstarch evenly over the potatoes.",
      "Use a pastry brush to coat the remaining potato slices with the egg white.",
      "Place a cornstarch slice on top of an egg white slice with the cornstarch and egg white on the inside. Repeat with the remaining potato slices.",
      "Use a sharp knife to remove the rounded edges of each layered potato so they are even rectangles.",
      "Working in batches to avoid overcrowding the pot, gently place the potatoes in the hot oil and fry until golden brown, about 2 minutes. Using a slotted spoon, transfer the potatoes to a paper towel-lined plate to drain. They will deflate, but don’t worry.",
      "Once all of the potatoes have been fried once, return to the oil for 1 minute more, until puffed and crispy. Remove from the oil, return to the paper towel-lined plate, and generously season with salt.",
      "In a small bowl, whisk together the creme fraiche, lime zest and juice, cumin, cayenne, chives, and bacon.",
      "Serve the bubble potato chips with the spiced creme fraiche.",
      "Enjoy!"
    ],
    "id": 16,
    "ingredients": [
      {
        "raw_text": "4 cups neutral oil, for frying",
        "ingredient_name": "neutral oil"
      },
      {
        "raw_text": "1 pound russet potatoes, scrubbed",
        "ingredient_name": "russet potato"
      },
      {
        "raw_text": "1/4 cup cornstarch",
        "ingredient_name": "cornstarch"
      },
      {
        "raw_text": "1 large egg white, beaten",
        "ingredient_name": "large egg white"
      },
      {
        "raw_text": "Kosher salt, to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1/2 cup creme fraiche",
        "ingredient_name": "creme fraiche"
      },
      {
        "raw_text": "Zest of 1 lime",
        "ingredient_name": "lime"
      },
      {
        "raw_text": "Juice of 1 lime",
        "ingredient_name": "lime"
      },
      {
        "raw_text": "1 teaspoon ground cumin",
        "ingredient_name": "ground cumin"
      },
      {
        "raw_text": "1/8 teaspoon cayenne",
        "ingredient_name": "cayenne pepper"
      },
      {
        "raw_text": "2 tablespoons minced fresh chives",
        "ingredient_name": "fresh chives"
      },
      {
        "raw_text": "4 ounces bacon, cooked and diced",
        "ingredient_name": "bacon"
      }
    ]
  },
  {
    "name": "Sour Cream And Onion Potato Chip Frittata",
    "total_time_minutes": 50,
    "num_servings": 8,
    "instructions": [
      "Preheat the oven to 325degreesF (160degreesC).",
      "Bring a medium saucepan of water to a simmer and season well with salt. Add the sliced potatoes and cook for 3-4 minutes, until tender and starting to turn translucent, but still slightly raw. Transfer to a paper towel-lined plate to drain.",
      "In a large bowl whisk together the eggs, heavy cream, 1 teaspoon salt, and pepper until homogeneous.",
      "Melt the butter in an 8-inch skillet over medium heat until bubbling, then remove the pan from the heat. Add half of the potatoes, about 1 cup of potato chips, and half of the scallions, chives, and dill. Pour half of the egg mixture over the top. Add the remaining potatoes, another cup of potato chips, and the remaining scallions, chives, and dill. Pour the remaining egg mixture over everything. Dollop the sour cream over the frittata and top with the remaining cup of potato chips.",
      "Bake for 22-25 minutes, until the frittata is puffed and set in the center.",
      "Let cool for 5 minutes before slicing and serving.",
      "Enjoy!"
    ],
    "id": 17,
    "ingredients": [
      {
        "raw_text": "1 teaspoon kosher salt, plus more to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "3-4 new potatoes, sliced into 1/8-inch-thick rounds",
        "ingredient_name": "potato"
      },
      {
        "raw_text": "8 large eggs",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "1/3 cup heavy cream",
        "ingredient_name": "heavy cream"
      },
      {
        "raw_text": "1/2 teaspoon freshly ground black pepper, plus more to taste",
        "ingredient_name": "freshly ground black pepper"
      },
      {
        "raw_text": "2 tablespoons salted butter",
        "ingredient_name": "salted butter"
      },
      {
        "raw_text": "3 cups thick-cut sour cream and onion or plain potato chips",
        "ingredient_name": "thick-cut sour cream and onion or plain potato chips"
      },
      {
        "raw_text": "2 scallions, thinly sliced, plus more for garnish",
        "ingredient_name": "scallions"
      },
      {
        "raw_text": "3 tablespoons minced fresh chives, plus more for garnish",
        "ingredient_name": "fresh chives"
      },
      {
        "raw_text": "3 tablespoons minced fresh dill, plus more for garnish",
        "ingredient_name": "fresh dill"
      },
      {
        "raw_text": "3-4 tablespoons sour cream",
        "ingredient_name": "sour cream"
      }
    ]
  },
  {
    "name": "One-Bowl Fudgy Brownies As Made By Alexis Deboschnek",
    "total_time_minutes": 75,
    "num_servings": 12,
    "instructions": [
      "Arrange a rack in the center of the oven. Preheat the oven to 350degreesF (180degreesC). Grease a 9 x 13-inch baking pan with nonstick spray. Line the pan with parchment paper.",
      "Place the chocolate in a large microwave-safe bowl and microwave in 30-second intervals, stirring between, until melted.",
      "Add melted butter to the bowl with the chocolate and beat with an electric hand mixer on medium speed until just combined. Add the sugar and beat until combined. Add the vanilla and eggs and beat until incorporated. Add a pinch of kosher salt and the flour and mix on low speed until just combined, making sure not to overmix.",
      "Add the walnuts, if using, and fold in with a rubber spatula until just incorporated.",
      "Pour the brownie batter into the prepared pan and smooth the top with the spatula.",
      "Place the baking pan on the center oven rack. Bake for 25 minutes, until the top is crinkly. These are barely baked, fudgy brownies. Do not use a toothpick to test, as it will come out with batter on it. The brownies will set as they rest.",
      "Let the brownies cool for 5 minutes, then sprinkle with flaky sea salt. Continue cooling until the brownies are room temperature, about 30 minutes.",
      "Carefully use the parchment paper to lift the brownies from the pan and transfer to a cutting board. Slice into 12 squares.",
      "Enjoy!"
    ],
    "id": 18,
    "ingredients": [
      {
        "raw_text": "Nonstick cooking spray, for greasing",
        "ingredient_name": "nonstick cooking spray"
      },
      {
        "raw_text": "6 ounces semisweet chocolate",
        "ingredient_name": "semisweet chocolate"
      },
      {
        "raw_text": "8 tablespoons (1/2 cup) unsalted butter, melted",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "11/2 cups sugar",
        "ingredient_name": "sugar"
      },
      {
        "raw_text": "2 teaspoons vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "4 large eggs",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "Pinch of kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 cup all-purpose flour",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "3/4 cup walnuts, roughly chopped (optional)",
        "ingredient_name": "walnuts"
      },
      {
        "raw_text": "Flaky sea salt, for sprinkling",
        "ingredient_name": "flaky sea salt"
      }
    ]
  },
  {
    "name": "How To Make Classic French Toast",
    "total_time_minutes": 20,
    "num_servings": 4,
    "instructions": [
      "Preheat a nonstick electric griddle to 300degreesF (150degreesC). (Alternatively, heat a large nonstick skillet over medium-low heat.)",
      "In a large bowl, whisk the eggs until well combined. Add the milk, heavy cream, brown sugar, salt, cinnamon, and vanilla bean paste and whisk until completely combined.",
      "Working in batches, dip each slice of challah in the custard, letting soak for 20-60 seconds on each side, until fully saturated but not soggy.",
      "Lightly grease the griddle with butter. Once melted, add the soaked challah on the griddle and cook, without disturbing, until golden brown and crispy, about 2 minutes. Use a flat spatula to flip the bread and continue cooking until the other side is golden brown, 2 minutes more. Wipe the pan clean between batches and add more butter as needed.",
      "Serve the French toast with a pat of butter, a drizzle of warm maple syrup, a sprinkle of flaky salt, and berries.",
      "Enjoy!"
    ],
    "id": 19,
    "ingredients": [
      {
        "raw_text": "6 large eggs",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "3/4 cup whole milk",
        "ingredient_name": "whole milk"
      },
      {
        "raw_text": "3/4 cup heavy cream",
        "ingredient_name": "heavy cream"
      },
      {
        "raw_text": "2-4 tablespoons light brown sugar",
        "ingredient_name": "light brown sugar"
      },
      {
        "raw_text": "1/2 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 teaspoon ground cinnamon",
        "ingredient_name": "ground cinnamon"
      },
      {
        "raw_text": "1 teaspoon vanilla bean paste or extract",
        "ingredient_name": "vanilla bean paste"
      },
      {
        "raw_text": "1 loaf of day-old challah bread, sliced 1-11/2-inch-thick",
        "ingredient_name": "challah bread"
      },
      {
        "raw_text": "Unsalted butter or ghee, for greasing",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "Softened butter",
        "ingredient_name": "softened butter"
      },
      {
        "raw_text": "Pure maple syrup, warmed",
        "ingredient_name": "pure maple syrup"
      },
      {
        "raw_text": "Flaky sea salt",
        "ingredient_name": "flaky sea salt"
      },
      {
        "raw_text": "Fresh berries",
        "ingredient_name": "fresh berries"
      }
    ]
  },
  {
    "name": "15-Minute Garlic Bread Pizza",
    "total_time_minutes": 15,
    "num_servings": 8,
    "instructions": [
      "Preheat the oven to 450degreesF (230degreesC).",
      "Arrange the frozen garlic toast on the prepared baking sheet.",
      "Make the pepperoni garlic bread pizza: Top 2 slices of garlic toast with the pizza sauce, mozzarella, and pepperoni.",
      "Make the veggie lovers garlic bread pizza: Top 2 slices of garlic toast with the pizza sauce, mozzarella, bell pepper, zucchini, mushrooms, and olives.",
      "Make the bacon jalapeno garlic bread pizza: Top 2 slices of garlic toast with the ranch, mozzarella, crumbled bacon, and pickled jalapeno slices.",
      "Make the margherita garlic bread pizza: Top 2 slices of garlic toast with the tomato slices and mozzarella.",
      "Bake for 8-12 minutes, until the bread is crispy and warmed through and the cheese is melted. Garnish the margherita garlic bread pizzas with the basil.",
      "Enjoy!"
    ],
    "id": 20,
    "ingredients": [
      {
        "raw_text": "8 slices of frozen garlic toast",
        "ingredient_name": "frozen garlic toast"
      },
      {
        "raw_text": "2 tablespoons pizza sauce",
        "ingredient_name": "pizza sauce"
      },
      {
        "raw_text": "1/4 cup shredded mozzarella cheese",
        "ingredient_name": "shredded mozzarella cheese"
      },
      {
        "raw_text": "6 pepperoni",
        "ingredient_name": "pepperoni"
      },
      {
        "raw_text": "2 tablespoons pizza sauce",
        "ingredient_name": "pizza sauce"
      },
      {
        "raw_text": "1/4 cup shredded mozzarella cheese",
        "ingredient_name": "shredded mozzarella cheese"
      },
      {
        "raw_text": "2 teaspoons diced bell pepper",
        "ingredient_name": "bell pepper"
      },
      {
        "raw_text": "3 slices of zucchini, cut into half-moons",
        "ingredient_name": "zucchini"
      },
      {
        "raw_text": "4 slices of button mushroom",
        "ingredient_name": "button mushroom"
      },
      {
        "raw_text": "6 slices of black olive",
        "ingredient_name": "black olive"
      },
      {
        "raw_text": "2 tablespoons ranch dressing",
        "ingredient_name": "ranch dressing"
      },
      {
        "raw_text": "1/4 cup shredded mozzarella cheese",
        "ingredient_name": "shredded mozzarella cheese"
      },
      {
        "raw_text": "1/4 cup crumbled cooked bacon",
        "ingredient_name": "bacon"
      },
      {
        "raw_text": "6 slices of pickled jalapeno",
        "ingredient_name": "pickled jalapenos"
      },
      {
        "raw_text": "4 slices of Roma tomato",
        "ingredient_name": "roma tomato"
      },
      {
        "raw_text": "1/4 cup shredded mozzarella cheese",
        "ingredient_name": "shredded mozzarella cheese"
      },
      {
        "raw_text": "1 teaspoon chopped fresh basil",
        "ingredient_name": "fresh basil leaf"
      }
    ]
  },
  {
    "name": "Sock-It-To-Me Cake",
    "total_time_minutes": 200,
    "num_servings": 12,
    "instructions": [
      "Make the filling: In a small bowl, stir together the pecans, brown sugar, and cinnamon.",
      "Make the cake: Preheat the oven to 325F (160degreesC). Grease a 10-cup Bundt pan with butter.",
      "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter on medium speed until smooth, about 1 minute. Add the granulated sugar, baking powder, and salt. Continue mixing on medium speed, scraping down the sides of the bowl occasionally, until light and fluffy, about 8 minutes.",
      "Add the eggs, 1 at a time, and mix on medium speed, making sure each egg is fully incorporated before adding the next. Scrape down the sides and bottom of the bowl. Add the vanilla and mix until combined.",
      "Add one third of the flour and mix on medium speed until just combined, then add half of the sour cream and continue mixing until just combined. Scrape down the sides and bottom of the bowl, then continue alternating additions of flour and sour cream. Use the rubber spatula to bring the batter together.",
      "Pour half of the batter into the prepared Bundt pan and tap the pan against the counter to settle the batter and release any air bubbles. Sprinkle the filling evenly over the batter. Spoon the remaining batter on top and carefully spread in an even layer to cover the filling.",
      "Bake the cake until a toothpick inserted in the center comes out clean, 60-70 minutes. Remove from the oven and let cool for 10 minutes.",
      "While the cake cools, make the icing: In a small bowl, whisk together the powdered sugar, milk, and vanilla until smooth.",
      "Invert the cake onto a serving plate and remove the Bundt pan. Pour the glaze over the cake to cover completely. Garnish with pecan halves.",
      "Slice and serve.",
      "Enjoy!"
    ],
    "id": 21,
    "ingredients": [
      {
        "raw_text": "1 cup chopped toasted pecans",
        "ingredient_name": "toasted pecans"
      },
      {
        "raw_text": "1/3 cup brown sugar",
        "ingredient_name": "brown sugar"
      },
      {
        "raw_text": "2 teaspoons ground cinnamon",
        "ingredient_name": "ground cinnamon"
      },
      {
        "raw_text": "11/2 cups (3 sticks) unsalted butter, softened, plus more for greasing",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "21/2 cups granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "1 teaspoon baking powder",
        "ingredient_name": "baking powder"
      },
      {
        "raw_text": "1 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "6 large eggs, room temperature",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "1 tablespoon vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "31/3 cups cake flour",
        "ingredient_name": "cake flour"
      },
      {
        "raw_text": "1 cup sour cream, room temperature",
        "ingredient_name": "sour cream"
      },
      {
        "raw_text": "2 cups powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "3 tablespoons milk",
        "ingredient_name": "milk"
      },
      {
        "raw_text": "1 teaspoon vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "Pecan halves, for garnish",
        "ingredient_name": "pecan halves"
      },
      {
        "raw_text": "10-cup fluted Bundt pan",
        "ingredient_name": "bundt pan"
      }
    ]
  },
  {
    "name": "The Best Classic Espresso Martini You'll Ever Sip",
    "total_time_minutes": 5,
    "num_servings": 1,
    "instructions": [
      "Fill a cocktail shaker with ice. Add the vodka, espresso, coffee liqueur, and simple syrup. Secure the lid and shake vigorously for 20 seconds.",
      "Strain the cocktail into a 6-ounce martini glass and garnish with the espresso beans.",
      "Enjoy!"
    ],
    "id": 22,
    "ingredients": [
      {
        "raw_text": "Ice, for shaking",
        "ingredient_name": "ice"
      },
      {
        "raw_text": "2 ounces vodka",
        "ingredient_name": "vodka"
      },
      {
        "raw_text": "1 ounce fresh espresso or cold brew concentrate",
        "ingredient_name": "fresh espresso"
      },
      {
        "raw_text": "1/2 ounce coffee liqueur",
        "ingredient_name": "coffee liqueur"
      },
      {
        "raw_text": "1/4 ounce simple syrup",
        "ingredient_name": "simple syrup"
      },
      {
        "raw_text": "3 espresso beans, for garnish",
        "ingredient_name": "espresso beans"
      }
    ]
  },
  {
    "name": "Crispy Chili Oil-Fried Eggs",
    "total_time_minutes": 80,
    "num_servings": 4,
    "instructions": [
      "Make the chili oil: Add the shallot, garlic, Sichuan peppercorns, bay leaves, cinnamon sticks, and peanut oil to a small saucepan. Cook over medium-low heat until the temperature reaches 215-225degreesF (101-107degreesC). Simmer for 30 minutes, until the aromatics are golden brown, but not burnt. The oil should be gently simmering, with tiny bubbles rising to the surface. If the oil gets too hot or the aromatics start to brown too quickly, reduce the heat to low.",
      "Add the Sichuan red chili flakes and Chinese five-spice powder to a medium, heatproof bowl. Place a fine-mesh strainer over the bowl. Carefully pour the hot oil through the strainer over the chili flakes and discard the aromatics left behind. Stir in the salt until dissolved. Let the chili oil cool completely before transferring to an airtight container. The chili oil will keep in the refrigerator for up to 6 months.",
      "Make the egg skillet: In a 10-inch cast iron skillet, heat 4 tablespoons of chili oil over medium heat until sizzling. Crack the eggs into the skillet and season with kosher salt. Cook for 2-3 minutes, depending on your preferred yolk doneness. Carefully tilt the skillet to distribute the chili oil around the eggs and use a spoon to baste the eggs with the oil.",
      "Remove the skillet from heat and top the eggs with the dill, scallions, and flaky sea salt. Serve with toasted bread.",
      "Enjoy!"
    ],
    "id": 23,
    "ingredients": [
      {
        "raw_text": "1 large shallot, peeled and quartered",
        "ingredient_name": "large shallot"
      },
      {
        "raw_text": "5-6 large garlic cloves, crushed",
        "ingredient_name": "garlic"
      },
      {
        "raw_text": "2 tablespoons whole Sichuan peppercorns",
        "ingredient_name": "whole sichuan peppercorns"
      },
      {
        "raw_text": "2 dried bay leaves",
        "ingredient_name": "dried bay leaf"
      },
      {
        "raw_text": "2 whole cinnamon sticks",
        "ingredient_name": "whole cinnamon sticks"
      },
      {
        "raw_text": "2 cups peanut oil or other neutral, high-heat oil, such as safflower",
        "ingredient_name": "peanut oil"
      },
      {
        "raw_text": "1 cup Sichuan red chili flakes",
        "ingredient_name": "Sichuan red chile flakes"
      },
      {
        "raw_text": "11/2 teaspoons Chinese five-spice powder",
        "ingredient_name": "Chinese five-spice powder"
      },
      {
        "raw_text": "11/2 teaspoons kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "4 tablespoons chili oil",
        "ingredient_name": "chili oil"
      },
      {
        "raw_text": "4 large eggs",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "Kosher salt, to taste",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "2 tablespoons roughly chopped fresh dill fronds",
        "ingredient_name": "fresh dill fronds"
      },
      {
        "raw_text": "2 tablespoons thinly sliced scallions",
        "ingredient_name": "scallions"
      },
      {
        "raw_text": "Flaky sea salt, to taste",
        "ingredient_name": "flaky sea salt"
      },
      {
        "raw_text": "Toasted bread, for serving",
        "ingredient_name": "toasted bread"
      }
    ]
  },
  {
    "name": "Olive Oil Orange Cake",
    "total_time_minutes": 125,
    "num_servings": 8,
    "instructions": [
      "In a large bowl, stir together the sugar and orange zest. Let sit for 30-60 minutes to allow the orange oils to perfume the sugar, which will enhance the flavor of the cake.",
      "Preheat the oven to 375degreesF (190degreesC).",
      "In a medium bowl, whisk together the all-purpose flour, almond flour, baking powder, and salt.",
      "Add the eggs to the orange-infused sugar. Using an electric hand mixer on medium speed, beat together until smooth and fluffy, 1-2 minutes. Add the Greek yogurt, orange juice, vanilla, and  olive oil and beat on medium-low speed until combined.",
      "Add the dry ingredients to the wet ingredients in 2 batches and mix on low speed until just combined. The batter should be thick, but smooth, and fall off the beaters in thick ribbons.",
      "Lightly grease a 9-inch cake pan with olive oil. Line the bottom with a parchment paper round and lightly grease with more oil. Pour the batter into the prepared pan.",
      "Bake the cake for 40-45 minutes, or until golden and a toothpick inserted in the center comes out clean. Let cool on a wire rack for 20 minutes before inverting the cake from the pan. Remove the parchment paper and flip right-side up.",
      "Dust the top of the cake with the powdered sugar, then slice and serve with whipped cream alongside, if desired.",
      "Enjoy!"
    ],
    "id": 24,
    "ingredients": [
      {
        "raw_text": "11/4 cups granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "Zest of 1 large navel orange",
        "ingredient_name": "navel orange"
      },
      {
        "raw_text": "13/4 cups all-purpose flour",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "1/2 cup finely ground almond flour",
        "ingredient_name": "almond flour"
      },
      {
        "raw_text": "2 teaspoons baking powder",
        "ingredient_name": "baking powder"
      },
      {
        "raw_text": "11/2 teaspoons kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "2 large eggs, room temperature",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "1/2 cup full-fat Greek yogurt",
        "ingredient_name": "full-fat greek yogurt"
      },
      {
        "raw_text": "Juice of 1 large navel orange",
        "ingredient_name": "large navel orange"
      },
      {
        "raw_text": "11/2 teaspoon vanilla extract",
        "ingredient_name": "vanilla extract"
      },
      {
        "raw_text": "1/3 cup olive oil, plus more for greasing",
        "ingredient_name": "olive oil"
      },
      {
        "raw_text": "1 tablespoon powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "Whipped cream, for serving (optional)",
        "ingredient_name": "whipped cream"
      }
    ]
  },
  {
    "name": "Korean Corn Dogs",
    "total_time_minutes": 30,
    "num_servings": 12,
    "instructions": [
      "Fill a large stock pot fitted with a deep-fry thermometer with canola oil. Heat the oil over medium-high heat until the temperature reaches 350degreesF (180degreesC). Reduce the heat to medium to maintain the temperature. Set a wire rack over a baking sheet and place it nearby.",
      "Prepare the potatoes: Bring a large pot of salted water to a boil. Add the potatoes and blanch for 2 minutes, then drain and transfer to a medium bowl. Let cool to room temperature, 15-20 minutes. Once cooled, sprinkle the flour over the potatoes and toss until well coated, shaking off and discarding any excess.",
      "Make the batter: In a medium bowl, whisk together the flour, sugar, baking powder, and salt. In a 2-cup liquid measuring cup, whisk together 1 cup of milk and the egg until well combined. Pour the wet ingredients into the dry ingredients and whisk until combined. The batter should be fairly thick; if it is too thick to whisk, add more milk, 1 tablespoon at a time. Transfer the batter to a pint glass or another tall, narrow container. Refrigerate until ready to use.",
      "Thread each hot dog half onto the pointy end of a skewer, cut-side up, pushing down to about 2 inches below the tip. Thread the mozzarella rectangles onto the skewers above the hot dogs so they are flush with the cut ends of the hot dogs and the tips of the skewers.",
      "Add the panko, floured potatoes, and rice puffs to individual plates or small trays.",
      "Working one at a time, dip a cheese and hot dog skewer into the cup with the batter, coating completely. Gently shake off any excess batter.",
      "For the original dogs: Roll a battered dog in the panko bread crumbs until well coated, using your fingers to pack on the bread crumbs as needed.",
      "For the potato dogs: Roll a battered dog in the floured potatoes, using your hands to pack on the potatoes to ensure they stick. Immediately roll the potato-coated dog in the panko bread crumbs until completely coated.",
      "For the crispy rice dogs: Roll a battered dog in rice puffs until completely coated, using your fingers to pack on the puffs as needed.",
      "Place the coated dogs in the hot oil, 2-3 at a time, and fry for 2-3 minutes, until golden brown and crispy, using tongs to turn as needed. Transfer to the wire rack and sprinkle all over with sugar (use tongs when turning; the sticks will be very hot). Repeat with the remaining corn dogs to make 4 of each kind.",
      "To serve, drizzle ketchup and mustard over the corn dogs.",
      "Enjoy!"
    ],
    "id": 25,
    "ingredients": [
      {
        "raw_text": "Canola oil, for frying",
        "ingredient_name": "canola oil"
      },
      {
        "raw_text": "Kosher salt, for boiling",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "11/2 pounds russet potatoes, peeled and cut into 1/4-inch dice (about 2 cups)",
        "ingredient_name": "russet potato"
      },
      {
        "raw_text": "2-4 tablespoons all-purpose flour",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "2 cups all-purpose flour",
        "ingredient_name": "all purpose flour"
      },
      {
        "raw_text": "3 tablespoons granulated sugar",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "1 tablespoon baking powder",
        "ingredient_name": "baking powder"
      },
      {
        "raw_text": "1/2 teaspoon kosher salt",
        "ingredient_name": "kosher salt"
      },
      {
        "raw_text": "1 cup plus 3 tablespoons whole milk",
        "ingredient_name": "whole milk"
      },
      {
        "raw_text": "1 large egg, beaten",
        "ingredient_name": "large egg"
      },
      {
        "raw_text": "6 all-beef hot dogs, halved crosswise",
        "ingredient_name": "all-beef hot dogs"
      },
      {
        "raw_text": "2 8-ounce blocks of low-moisture mozzarella cheese, cut into 12 3/4-inch-wide rectangles",
        "ingredient_name": "shredded low moisture mozzarella cheese"
      },
      {
        "raw_text": "2-3 cups panko bread crumbs",
        "ingredient_name": "panko breadcrumbs"
      },
      {
        "raw_text": "2 cups Korean rice puffs or puffed millet cereal",
        "ingredient_name": "korean rice puffs"
      },
      {
        "raw_text": "1/4 cup granulated sugar, for sprinkling",
        "ingredient_name": "granulated sugar"
      },
      {
        "raw_text": "Yellow mustard",
        "ingredient_name": "yellow mustard"
      },
      {
        "raw_text": "12 8-inch wooden skewers",
        "ingredient_name": "wooden skewers"
      }
    ]
  },
  {
    "name": "Chocolate Flowers",
    "total_time_minutes": 60,
    "num_servings": 1,
    "instructions": [
      "Line a small baking sheet with parchment paper.",
      "Set a medium bowl over a small pot of simmering water. Add the white chocolate to the bowl and warm for 2-3 minutes, until about two thirds of the chocolate is melted. Stir to melt completely, then remove the bowl from the heat and let cool for about 10 minutes, until the temperature is between 85-90degreesF (29-32degreesC).",
      "Dip the back of a plastic spoon in the melted chocolate to coat. Use the edge of your thumb to wipe away any excess chocolate from the edges of the spoon, then place on the prepared baking sheet, chocolate-side up. Repeat with 10 more of the spoons. To create the smaller, inner petals, dip only the top half of the remaining 3 spoons into the chocolate, wiping away the excess around the edges. Freeze the spoons for 15 minutes.",
      "Remove the spoons from the refrigerator and repeat the dipping process to create a thicker layer of chocolate (this will make the petals sturdier and easier to handle). Freeze for another 15 minutes.",
      "Line a 2-inch wide round, such as a small jar lid, with a circle of parchment paper.",
      "Remove the spoons from the freezer and let thaw for about 5 minutes (this will make the chocolate easier to release). Working one at a time, gently slide the chocolate petals off of the spoons and onto the baking sheet (you may need to use your fingernail to gently release the chocolate from the spoons).",
      "Add a dollop of melted chocolate to the center of the parchment paper circle. Arrange 5 petals around the outer edge of the lid with the narrow ends facing outwards, pressing into the melted chocolate to secure. Add another small dollop of white chocolate to the center and arrange 3 more petals on top of the first layer. Add another dollop of melted chocolate and arrange the 3 small petals around the center. Add one more small dollop of melted chocolate to the center of the petals and fill with yellow sprinkles to resemble the center of a flower. Transfer the flower to the refrigerator to set for 30 minutes.",
      "Carefully peel the flowers away from the parchment paper and use to decorate cakes or cupcakes.",
      "Enjoy!"
    ],
    "id": 26,
    "ingredients": [
      {
        "raw_text": "6 ounces white chocolate melting wafers",
        "ingredient_name": "white chocolate melting wafers"
      },
      {
        "raw_text": "1 teaspoon yellow sprinkles",
        "ingredient_name": "yellow sprinkles"
      },
      {
        "raw_text": "14-28 plastic teaspoons",
        "ingredient_name": "plastic teaspoons"
      }
    ]
  },
  {
    "name": "Old-Fashioned Ice Tray Chocolates",
    "total_time_minutes": 240,
    "num_servings": 16,
    "instructions": [
      "Add the cherries and whiskey to a small container. Cover and let soak for at least 1 hour, or up to 2 days.",
      "Add the butter and cream cheese to a medium bowl. Beat with an electric hand mixer on medium speed until light and fluffy, 1-2 minutes, scraping down the sides of the bowl as needed. Sift in the powdered sugar and beat on medium-low speed to incorporate. Add the orange zest and fold with a rubber spatula until incorporated. The mixture should be stiff. Cover with plastic wrap and chill in the refrigerator for 30 minutes.",
      "Set a medium bowl over a small pot of simmering water. Add the dark chocolate and coconut oil to the bowl and warm for 4-5 minutes, until about two thirds of the chocolate is melted. Stir to melt the chocolate completely, then remove the bowl from the heat. Let cool for 5 minutes, until slightly thickened.",
      "Pour about half of the melted chocolate into a clean 14-cavity ice cube tray, tilting the tray to create a thin, even layer around the walls of each mold. Pour any excess chocolate back into the bowl and wipe away any excess chocolate from the sides of the tray. Freeze for 15-30 minutes, until the chocolate is set.",
      "Remove the cherries from the whiskey and drain on paper towels to remove excess moisture.",
      "Fill each chocolate-lined ice cube mold with 11/2 teaspoons of the orange-cream cheese filling. Use your finger to create a divot in the filling, then spoon 1/2 teaspoon of orange marmalade into the divot. Place a cherry in each divot, pressing down so the tops are below the rim of the tray.",
      "Melt the chocolate again over simmering water if necessary, then pour over the ice cube tray, tilting to evenly distribute. Tap the tray on a flat surface to release any air bubbles and smooth the top. Freeze for 30-60 minutes, until set.",
      "Remove the ice cube tray from the freezer and let sit at room temperature for 5 minutes to loosen the chocolates. Then, invert the tray to release the chocolates. Cut into individual chocolates and trim any messy edges with a paring knife. Serve immediately or store in the refrigerator for up to 1 week.",
      "Enjoy!"
    ],
    "id": 27,
    "ingredients": [
      {
        "raw_text": "14 maraschino cherries",
        "ingredient_name": "maraschino cherry"
      },
      {
        "raw_text": "2 tablespoons whiskey",
        "ingredient_name": "whiskey"
      },
      {
        "raw_text": "1/2 teaspoon unsalted butter, room temperature",
        "ingredient_name": "unsalted butter"
      },
      {
        "raw_text": "4 tablespoons cream cheese, room temperature",
        "ingredient_name": "cream cheese"
      },
      {
        "raw_text": "11/4 cups powdered sugar",
        "ingredient_name": "powdered sugar"
      },
      {
        "raw_text": "Zest of 1 orange (about 2 teaspoons)",
        "ingredient_name": "orange"
      },
      {
        "raw_text": "10 ounces dark chocolate melting wafers",
        "ingredient_name": "dark chocolate melting wafers"
      },
      {
        "raw_text": "1 teaspoon refined coconut oil",
        "ingredient_name": "coconut oil"
      },
      {
        "raw_text": "7 teaspoons orange marmalade",
        "ingredient_name": "orange marmalade"
      }
    ]
  },
  {
    "name": "Chocolate Mugs",
    "total_time_minutes": 115,
    "num_servings": 2,
    "instructions": [
      "Set a medium bowl over a small pot of simmering water. Add the dark chocolate to the bowl and warm for 4-5 minutes, until about two thirds of the chocolate is melted. Stir until the chocolate is completely melted, then remove the bowl from the heat. Let cool for 5 minutes, until slightly thickened. Leave the water in the saucepan.",
      "Pour 2 tablespoons of the melted chocolate into a paper cup and swirl to coat the inside, leaving a 11/2-inch border around the top edge of the cup (it's okay if the edge isn't perfectly straight; it will be smoothed out later). Continue turning the cup to layer the chocolate and create a thicker wall. Repeat with the other cup. Freeze the cups for 30-60 minutes, until fully set.",
      "Line a small baking sheet with parchment paper. Transfer some of the remaining melted chocolate to a small piping bag and cut a small hole about 1/4 inch from the tip. Pipe 2 1-inch long, 1/2-inch wide handles onto one side of the parchment paper, going over the shape multiple times to create a sturdy structure.",
      "Place the ring molds on the other side of the parchment paper. Fill the molds with melted chocolate to create circular bases for the mugs. Transfer the baking sheet to the freezer until the chocolate is set, about 15 minutes.",
      "Remove the cups from the freezer. Set a cup upside-down on a flat surface and use a paring knife to cut an 'X' in the bottom of the cup to release the chocolate. Lift the cup away (or use scissors to cut down from the lip of the cup to the top of the chocolate rim and gently peel the cup away). If the chocolate starts to get warm, return to the freezer for 5-10 minutes before proceeding.",
      "Heat the water in the pot until steaming. Place a small metal baking sheet on top of the steaming pot to warm. Press the top edge of a chocolate cup onto the warm pan to melt the chocolate and create a smooth edge. Melt the bottom of the cup on the warm pan, then press against a circular base to adhere. Melt the edges of a handle and press against the side of the cup to adhere. Repeat to make the remaining chocolate mug. Transfer to the refrigerator to set for 30 minutes.",
      "Fill each mug with chocolate mousse and top with raspberries and a sprig of mint.",
      "Enjoy!"
    ],
    "id": 28,
    "ingredients": [
      {
        "raw_text": "6 ounces dark chocolate melting wafters",
        "ingredient_name": "dark chocolate melting wafters"
      },
      {
        "raw_text": "1 batch [Chocolate Mousse] (https://tasty.co/recipe/chocolate-mousse)",
        "ingredient_name": "Chocolate Mousse"
      },
      {
        "raw_text": "Fresh raspberries, for garnish",
        "ingredient_name": "fresh raspberry"
      },
      {
        "raw_text": "2 small sprigs of fresh mint, for garnish",
        "ingredient_name": "fresh mint"
      },
      {
        "raw_text": "2 8-ounce paper cups",
        "ingredient_name": "small paper cups"
      },
      {
        "raw_text": "Piping bag",
        "ingredient_name": "piping bag"
      },
      {
        "raw_text": "2 21/2-inch-wide ring molds",
        "ingredient_name": "ring molds"
      }
    ]
  },
  {
    "name": "Chinese Chicken Fried Rice",
    "total_time_minutes": 35,
    "num_servings": 2,
    "instructions": [
      "Heat a wok over medium-high heat for 5 minutes. Add the oil then stir in eggs and fry until just cooked. Once cooked, remove eggs from the wok and set aside.",
      "Heat up the wok until smoking hot and pour in the oil.",
      "Add the chicken breast and fry until they are just cooked.",
      "Add the rice and keep frying until they turn slightly brown.",
      "Add the vegetables and fry everything together until they are thoroughly cooked.",
      "Pour in the soy sauce and stir.",
      "Add the cooked eggs back in and toss them around until they break into pieces.",
      "Add in the spring onions and serve.",
      "Enjoy!"
    ],
    "id": 32,
    "ingredients": [
      {
        "raw_text": "100 milliliters oil",
        "ingredient_name": "oil"
      },
      {
        "raw_text": "4 eggs",
        "ingredient_name": "egg"
      },
      {
        "raw_text": "A pinch of salt",
        "ingredient_name": "salt"
      },
      {
        "raw_text": "200 grams chicken breast, sliced",
        "ingredient_name": "boneless, skinless chicken breast"
      },
      {
        "raw_text": "400 grams cooked rice",
        "ingredient_name": "rice"
      },
      {
        "raw_text": "150 grams mixed vegetable",
        "ingredient_name": "mixed vegetable"
      },
      {
        "raw_text": "50 milliliters light soy sauce",
        "ingredient_name": "light soy sauce"
      },
      {
        "raw_text": "30 grams spring onion",
        "ingredient_name": "spring onion"
      }
    ]
  }
]